betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_eth.c
      case DAL_ETH_PMT_CB_ID :
        heth->PMTCallback = pCallback;
        break;


      case DAL_ETH_WAKEUP_CB_ID :
        heth->WakeUpCallback = pCallback;
        break;

      case DAL_ETH_MSPINIT_CB_ID :
        heth->MspInitCallback = pCallback;
        break;

      case DAL_ETH_MSPDEINIT_CB_ID :
        heth->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        heth->ErrorCode |= DAL_ETH_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (heth->gState == DAL_ETH_STATE_RESET)
  {
    switch (CallbackID)
    {
      case DAL_ETH_MSPINIT_CB_ID :
        heth->MspInitCallback = pCallback;
        break;

      case DAL_ETH_MSPDEINIT_CB_ID :
        heth->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        heth->ErrorCode |= DAL_ETH_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    heth->ErrorCode |= DAL_ETH_ERROR_INVALID_CALLBACK;
    /* Return error status */
    status =  DAL_ERROR;
  }

  return status;
}

/**
  * @brief  Unregister an ETH Callback
  *         ETH callabck is redirected to the weak predefined callback
  * @param heth eth handle
  * @param CallbackID ID of the callback to be unregistered
  *        This parameter can be one of the following values:
  *          @arg @ref DAL_ETH_TX_COMPLETE_CB_ID Tx Complete Callback ID
  *          @arg @ref DAL_ETH_RX_COMPLETE_CB_ID Rx Complete Callback ID
  *          @arg @ref DAL_ETH_ERROR_CB_ID       Error Callback ID
  *          @arg @ref DAL_ETH_PMT_CB_ID         Power Management Callback ID
  *          @arg @ref DAL_ETH_WAKEUP_CB_ID      Wake UP Callback ID
  *          @arg @ref DAL_ETH_MSPINIT_CB_ID     MspInit callback ID
  *          @arg @ref DAL_ETH_MSPDEINIT_CB_ID   MspDeInit callback ID
  * @retval status
  */
DAL_StatusTypeDef DAL_ETH_UnRegisterCallback(ETH_HandleTypeDef *heth, DAL_ETH_CallbackIDTypeDef CallbackID)
{
  DAL_StatusTypeDef status = DAL_OK;

  if (heth->gState == DAL_ETH_STATE_READY)
  {
    switch (CallbackID)
    {
      case DAL_ETH_TX_COMPLETE_CB_ID :
        heth->TxCpltCallback = DAL_ETH_TxCpltCallback;
        break;

      case DAL_ETH_RX_COMPLETE_CB_ID :
        heth->RxCpltCallback = DAL_ETH_RxCpltCallback;
        break;

      case DAL_ETH_ERROR_CB_ID :
        heth->ErrorCallback = DAL_ETH_ErrorCallback;
        break;

      case DAL_ETH_PMT_CB_ID :
        heth->PMTCallback = DAL_ETH_PMTCallback;
        break;


      case DAL_ETH_WAKEUP_CB_ID :
        heth->WakeUpCallback = DAL_ETH_WakeUpCallback;
        break;

      case DAL_ETH_MSPINIT_CB_ID :
        heth->MspInitCallback = DAL_ETH_MspInit;
        break;

      case DAL_ETH_MSPDEINIT_CB_ID :
        heth->MspDeInitCallback = DAL_ETH_MspDeInit;
        break;

      default :
        /* Update the error code */
        heth->ErrorCode |= DAL_ETH_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (heth->gState == DAL_ETH_STATE_RESET)
  {
    switch (CallbackID)
    {
      case DAL_ETH_MSPINIT_CB_ID :
        heth->MspInitCallback = DAL_ETH_MspInit;
        break;

      case DAL_ETH_MSPDEINIT_CB_ID :
        heth->MspDeInitCallback = DAL_ETH_MspDeInit;
        break;

      default :
        /* Update the error code */
        heth->ErrorCode |= DAL_ETH_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    heth->ErrorCode |= DAL_ETH_ERROR_INVALID_CALLBACK;
    /* Return error status */
    status =  DAL_ERROR;
  }

  return status;
}
#endif /* USE_DAL_ETH_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup ETH_Exported_Functions_Group2 IO operation functions
  *  @brief ETH Transmit and Receive functions
  *
@verbatim
  ==============================================================================
                      ##### IO operation functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to manage the ETH
    data transfer.

@endverbatim
  * @{
  */

/**
  * @brief  Enables Ethernet MAC and DMA reception and transmission
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ETH_Start(ETH_HandleTypeDef *heth)
{
  if (heth->gState == DAL_ETH_STATE_READY)
  {
    heth->gState = DAL_ETH_STATE_BUSY;

    /* Set nombre of descriptors to build */
    heth->RxDescList.RxBuildDescCnt = ETH_RX_DESC_CNT;

    /* Build all descriptors */
    ETH_UpdateDescriptor(heth);

    /* Enable the MAC transmission */
    SET_BIT(heth->Instance->MACCFG, ETH_MACCFG_TXEN);

    /* Enable the MAC reception */
    SET_BIT(heth->Instance->MACCFG, ETH_MACCFG_RXEN);

    /* Flush Transmit FIFO */
    ETH_FlushTransmitFIFO(heth);

    /* Enable the DMA transmission */
    SET_BIT(heth->Instance->DMAOPMOD, ETH_DMAOPMOD_STTX);

    /* Enable the DMA reception */
    SET_BIT(heth->Instance->DMAOPMOD, ETH_DMAOPMOD_STRX);

    heth->gState = DAL_ETH_STATE_STARTED;

    return DAL_OK;
  }
  else
  {
    return DAL_ERROR;
  }
}

/**
  * @brief  Enables Ethernet MAC and DMA reception/transmission in Interrupt mode
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ETH_Start_IT(ETH_HandleTypeDef *heth)
{
  if (heth->gState == DAL_ETH_STATE_READY)
  {
    heth->gState = DAL_ETH_STATE_BUSY;

    /* save IT mode to ETH Handle */
    heth->RxDescList.ItMode = 1U;
    /* Disable MMC Interrupts */
    SET_BIT(heth->Instance->MACIMASK, ETH_MACIMASK_TSTIM | ETH_MACIMASK_PMTIM);

    /* Disable Rx MMC Interrupts */
    SET_BIT(heth->Instance->MMCRXINTMASK, ETH_MMCRXINTMASK_RXGUNFM | ETH_MMCRXINTMASK_RXFAEM | \
            ETH_MMCRXINTMASK_RXFCEM);

    /* Disable Tx MMC Interrupts */
    SET_BIT(heth->Instance->MMCTXINTMASK, ETH_MMCTXINTMASK_TXGFM | ETH_MMCTXINTMASK_TXGFMCOLM | \
            ETH_MMCTXINTMASK_TXGFSCOLM);

    /* Set nombre of descriptors to build */
    heth->RxDescList.RxBuildDescCnt = ETH_RX_DESC_CNT;

    /* Build all descriptors */
    ETH_UpdateDescriptor(heth);

