betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_eth.c
    /* Enable the MAC transmission */
    SET_BIT(heth->Instance->MACCFG, ETH_MACCFG_TXEN);

    /* Enable the MAC reception */
    SET_BIT(heth->Instance->MACCFG, ETH_MACCFG_RXEN);

    /* Flush Transmit FIFO */
    ETH_FlushTransmitFIFO(heth);

    /* Enable the DMA transmission */
    SET_BIT(heth->Instance->DMAOPMOD, ETH_DMAOPMOD_STTX);

    /* Enable the DMA reception */
    SET_BIT(heth->Instance->DMAOPMOD, ETH_DMAOPMOD_STRX);

    /* Enable ETH DMA interrupts:
    - Tx complete interrupt
    - Rx complete interrupt
    - Fatal bus interrupt
    */
    __DAL_ETH_DMA_ENABLE_IT(heth, (ETH_DMAINTEN_NINTSEN | ETH_DMAINTEN_RXIEN | ETH_DMAINTEN_TXIEN  |
                                   ETH_DMAINTEN_FBERREN | ETH_DMAINTEN_AINTSEN | ETH_DMAINTEN_RXBUEN));

    heth->gState = DAL_ETH_STATE_STARTED;
    return DAL_OK;
  }
  else
  {
    return DAL_ERROR;
  }
}

/**
  * @brief  Stop Ethernet MAC and DMA reception/transmission
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ETH_Stop(ETH_HandleTypeDef *heth)
{
  if (heth->gState == DAL_ETH_STATE_STARTED)
  {
    /* Set the ETH peripheral state to BUSY */
    heth->gState = DAL_ETH_STATE_BUSY;
    /* Disable the DMA transmission */
    CLEAR_BIT(heth->Instance->MACCFG, ETH_MACCFG_TXEN);

    /* Disable the DMA reception */
    CLEAR_BIT(heth->Instance->DMAOPMOD, ETH_DMAOPMOD_STRX);

    /* Disable the MAC reception */
    CLEAR_BIT(heth->Instance->MACCFG, ETH_MACCFG_RXEN);

    /* Flush Transmit FIFO */
    ETH_FlushTransmitFIFO(heth);

    /* Disable the MAC transmission */
    CLEAR_BIT(heth->Instance->MACCFG, ETH_MACCFG_TXEN);

    heth->gState = DAL_ETH_STATE_READY;

    /* Return function status */
    return DAL_OK;
  }
  else
  {
    return DAL_ERROR;
  }
}

/**
  * @brief  Stop Ethernet MAC and DMA reception/transmission in Interrupt mode
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ETH_Stop_IT(ETH_HandleTypeDef *heth)
{
  ETH_DMADescTypeDef *dmarxdesc;
  uint32_t descindex;

  if (heth->gState == DAL_ETH_STATE_STARTED)
  {
    /* Set the ETH peripheral state to BUSY */
    heth->gState = DAL_ETH_STATE_BUSY;

    __DAL_ETH_DMA_DISABLE_IT(heth, (ETH_DMAINTEN_NINTSEN | ETH_DMAINTEN_RXIEN | ETH_DMAINTEN_TXIEN  |
                                    ETH_DMAINTEN_FBERREN | ETH_DMAINTEN_AINTSEN | ETH_DMAINTEN_RXBUEN));

    /* Disable the DMA transmission */
    CLEAR_BIT(heth->Instance->MACCFG, ETH_MACCFG_TXEN);

    /* Disable the DMA reception */
    CLEAR_BIT(heth->Instance->DMAOPMOD, ETH_DMAOPMOD_STRX);

    /* Disable the MAC reception */
    CLEAR_BIT(heth->Instance->MACCFG, ETH_MACCFG_RXEN);
    /* Flush Transmit FIFO */
    ETH_FlushTransmitFIFO(heth);

    /* Disable the MAC transmission */
    CLEAR_BIT(heth->Instance->MACCFG, ETH_MACCFG_TXEN);

    /* Clear IOC bit to all Rx descriptors */
    for (descindex = 0; descindex < (uint32_t)ETH_RX_DESC_CNT; descindex++)
    {
      dmarxdesc = (ETH_DMADescTypeDef *)heth->RxDescList.RxDesc[descindex];
      SET_BIT(dmarxdesc->DESC1, ETH_DMARXDESC_DIC);
    }

    heth->RxDescList.ItMode = 0U;

    heth->gState = DAL_ETH_STATE_READY;

    /* Return function status */
    return DAL_OK;
  }
  else
  {
    return DAL_ERROR;
  }
}

/**
  * @brief  Sends an Ethernet Packet in polling mode.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  pTxConfig: Hold the configuration of packet to be transmitted
  * @param  Timeout: timeout value
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ETH_Transmit(ETH_HandleTypeDef *heth, ETH_TxPacketConfig *pTxConfig, uint32_t Timeout)
{
  uint32_t tickstart;
  ETH_DMADescTypeDef *dmatxdesc;

  if (pTxConfig == NULL)
  {
    heth->ErrorCode |= DAL_ETH_ERROR_PARAM;
    return DAL_ERROR;
  }

  if (heth->gState == DAL_ETH_STATE_STARTED)
  {
    /* Config DMA Tx descriptor by Tx Packet info */
    if (ETH_Prepare_Tx_Descriptors(heth, pTxConfig, 0) != DAL_ETH_ERROR_NONE)
    {
      /* Set the ETH error code */
      heth->ErrorCode |= DAL_ETH_ERROR_BUSY;
      return DAL_ERROR;
    }

    /* Ensure completion of descriptor preparation before transmission start */
    __DSB();

    dmatxdesc = (ETH_DMADescTypeDef *)(&heth->TxDescList)->TxDesc[heth->TxDescList.CurTxDesc];

    /* Incr current tx desc index */
    INCR_TX_DESC_INDEX(heth->TxDescList.CurTxDesc, 1U);

    /* Start transmission */
    /* issue a poll command to Tx DMA by writing address of next immediate free descriptor */
    WRITE_REG(heth->Instance->DMATXPD, (uint32_t)(heth->TxDescList.TxDesc[heth->TxDescList.CurTxDesc]));

    tickstart = DAL_GetTick();

    /* Wait for data to be transmitted or timeout occurred */
    while ((dmatxdesc->DESC0 & ETH_DMATXDESC_OWN) != (uint32_t)RESET)
    {
      if ((heth->Instance->DMASTS & ETH_DMASTS_FBERRFLG) != (uint32_t)RESET)
      {
        heth->ErrorCode |= DAL_ETH_ERROR_DMA;
        heth->DMAErrorCode = heth->Instance->DMASTS;
        /* Return function status */
        return DAL_ERROR;
      }

      /* Check for the Timeout */
      if (Timeout != DAL_MAX_DELAY)
      {
        if (((DAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
        {
          heth->ErrorCode |= DAL_ETH_ERROR_TIMEOUT;
          /* Clear TX descriptor so that we can proceed */
          dmatxdesc->DESC0 = (ETH_DMATXDESC_FS | ETH_DMATXDESC_LS);
          return DAL_ERROR;
        }
      }
    }

    /* Return function status */
    return DAL_OK;
  }
  else
  {
    return DAL_ERROR;
  }
}

/**
  * @brief  Sends an Ethernet Packet in interrupt mode.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  pTxConfig: Hold the configuration of packet to be transmitted
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ETH_Transmit_IT(ETH_HandleTypeDef *heth, ETH_TxPacketConfig *pTxConfig)
{
  if (pTxConfig == NULL)
  {
    heth->ErrorCode |= DAL_ETH_ERROR_PARAM;
    return DAL_ERROR;
  }

  if (heth->gState == DAL_ETH_STATE_STARTED)
  {
    /* Save the packet pointer to release.  */
    heth->TxDescList.CurrentPacketAddress = (uint32_t *)pTxConfig->pData;

    /* Config DMA Tx descriptor by Tx Packet info */
    if (ETH_Prepare_Tx_Descriptors(heth, pTxConfig, 1) != DAL_ETH_ERROR_NONE)
    {
      heth->ErrorCode |= DAL_ETH_ERROR_BUSY;
      return DAL_ERROR;
    }

    /* Ensure completion of descriptor preparation before transmission start */
    __DSB();

    /* Incr current tx desc index */
    INCR_TX_DESC_INDEX(heth->TxDescList.CurTxDesc, 1U);

    /* Start transmission */
    /* issue a poll command to Tx DMA by writing address of next immediate free descriptor */
    if (((heth->Instance)->DMASTS & ETH_DMASTS_TXBU) != (uint32_t)RESET)
    {
      /* Clear TXBU ETHERNET DMA flag */
      (heth->Instance)->DMASTS = ETH_DMASTS_TXBU;
      /* Resume DMA transmission*/
      (heth->Instance)->DMATXPD = 0U;
    }

    return DAL_OK;

