betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_eth.c
    /* Get NanoSeconds */
    time->NanoSeconds = heth->Instance->PTPTSL;

    /* Return function status */
    return DAL_OK;
  }
  else
  {
    /* Return function status */
    return DAL_ERROR;
  }
}

/**
  * @brief  Update time for the Ethernet PTP registers.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  timeupdate: pointer to a ETH_TIMEUPDATETypeDef structure that contains
  *         the time update information
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ETH_PTP_AddTimeOffset(ETH_HandleTypeDef *heth, ETH_PtpUpdateTypeDef ptpoffsettype,
                                            ETH_TimeTypeDef *timeoffset)
{
  if (heth->IsPtpConfigured == DAL_ETH_PTP_CONFIGURATED)
  {
    if (ptpoffsettype ==  DAL_ETH_PTP_NEGATIVE_UPDATE)
    {
      /* Set Seconds update */
      heth->Instance->PTPTSHUD = ETH_PTPTSH_VALUE - timeoffset->Seconds + 1U;

      if (READ_BIT(heth->Instance->PTPTSCTRL, ETH_PTPTSCTRL_TSSUBRO) == ETH_PTPTSCTRL_TSSUBRO)
      {
        /* Set nanoSeconds update */
        heth->Instance->PTPTSLUD = ETH_PTPTSL_VALUE - timeoffset->NanoSeconds;
      }
      else
      {
        heth->Instance->PTPTSLUD = ETH_PTPTSH_VALUE - timeoffset->NanoSeconds + 1U;
      }
    }
    else
    {
      /* Set Seconds update */
      heth->Instance->PTPTSHUD = timeoffset->Seconds;
      /* Set nanoSeconds update */
      heth->Instance->PTPTSLUD = timeoffset->NanoSeconds;
    }

    /* Return function status */
    return DAL_OK;
  }
  else
  {
    /* Return function status */
    return DAL_ERROR;
  }
}

/**
  * @brief  Insert Timestamp in transmission.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  txtimestampconf: Enable or Disable timestamp in transmission
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ETH_PTP_InsertTxTimestamp(ETH_HandleTypeDef *heth)
{
  ETH_TxDescListTypeDef *dmatxdesclist = &heth->TxDescList;
  uint32_t descidx = dmatxdesclist->CurTxDesc;
  ETH_DMADescTypeDef *dmatxdesc = (ETH_DMADescTypeDef *)dmatxdesclist->TxDesc[descidx];

  if (heth->IsPtpConfigured == DAL_ETH_PTP_CONFIGURATED)
  {
    /* Enable Time Stamp transmission */
    SET_BIT(dmatxdesc->DESC0, ETH_DMATXDESC_TTSE);

    /* Return function status */
    return DAL_OK;
  }
  else
  {
    /* Return function status */
    return DAL_ERROR;
  }
}

/**
  * @brief  Get transmission timestamp.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  timestamp: pointer to ETH_TIMESTAMPTypeDef structure that contains
  *         transmission timestamp
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ETH_PTP_GetTxTimestamp(ETH_HandleTypeDef *heth, ETH_TimeStampTypeDef *timestamp)
{
  ETH_TxDescListTypeDef *dmatxdesclist = &heth->TxDescList;
  uint32_t idx =       dmatxdesclist->releaseIndex;
  ETH_DMADescTypeDef *dmatxdesc = (ETH_DMADescTypeDef *)dmatxdesclist->TxDesc[idx];

  if (heth->IsPtpConfigured == DAL_ETH_PTP_CONFIGURATED)
  {
    /* Get timestamp low */
    timestamp->TimeStampLow = dmatxdesc->DESC0;
    /* Get timestamp high */
    timestamp->TimeStampHigh = dmatxdesc->DESC1;

    /* Return function status */
    return DAL_OK;
  }
  else
  {
    /* Return function status */
    return DAL_ERROR;
  }
}

/**
  * @brief  Get receive timestamp.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  timestamp: pointer to ETH_TIMESTAMPTypeDef structure that contains
  *         receive timestamp
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ETH_PTP_GetRxTimestamp(ETH_HandleTypeDef *heth, ETH_TimeStampTypeDef *timestamp)
{
  if (heth->IsPtpConfigured == DAL_ETH_PTP_CONFIGURATED)
  {
    /* Get timestamp low */
    timestamp->TimeStampLow = heth->RxDescList.TimeStamp.TimeStampLow;
    /* Get timestamp high */
    timestamp->TimeStampHigh = heth->RxDescList.TimeStamp.TimeStampHigh;

    /* Return function status */
    return DAL_OK;
  }
  else
  {
    /* Return function status */
    return DAL_ERROR;
  }
}

/**
  * @brief  Register the Tx Ptp callback.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  txPtpCallback: Function to handle Ptp transmission
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ETH_RegisterTxPtpCallback(ETH_HandleTypeDef *heth, pETH_txPtpCallbackTypeDef txPtpCallback)
{
  if (txPtpCallback == NULL)
  {
    /* No buffer to save */
    return DAL_ERROR;
  }
  /* Set Function to handle Tx Ptp */
  heth->txPtpCallback = txPtpCallback;

  return DAL_OK;
}

/**
  * @brief  Unregister the Tx Ptp callback.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ETH_UnRegisterTxPtpCallback(ETH_HandleTypeDef *heth)
{
  /* Set function to allocate buffer */
  heth->txPtpCallback = DAL_ETH_TxPtpCallback;

  return DAL_OK;
}

/**
  * @brief  Tx Ptp callback.
  * @param  buff: pointer to application buffer
  * @retval None
  */
__weak void DAL_ETH_TxPtpCallback(uint32_t *buff, ETH_TimeStampTypeDef *timestamp)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(buff);
  /* NOTE : This function Should not be modified, when the callback is needed,
  the DAL_ETH_TxPtpCallback could be implemented in the user file
  */
}
#endif  /* DAL_ETH_USE_PTP */

/**
  * @brief  This function handles ETH interrupt request.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval DAL status
  */
void DAL_ETH_IRQHandler(ETH_HandleTypeDef *heth)
{
  /* Packet received */
  if (__DAL_ETH_DMA_GET_IT(heth, ETH_DMASTS_RXFLG))
  {
    if (__DAL_ETH_DMA_GET_IT_SOURCE(heth, ETH_DMAINTEN_RXIEN))
    {
      /* Clear the Eth DMA Rx IT pending bits */
      __DAL_ETH_DMA_CLEAR_IT(heth, ETH_DMASTS_RXFLG | ETH_DMASTS_NINTS);

#if (USE_DAL_ETH_REGISTER_CALLBACKS == 1)
      /*Call registered Receive complete callback*/
      heth->RxCpltCallback(heth);
#else
      /* Receive complete callback */
      DAL_ETH_RxCpltCallback(heth);
#endif  /* USE_DAL_ETH_REGISTER_CALLBACKS */
    }
  }

  /* Packet transmitted */
  if (__DAL_ETH_DMA_GET_IT(heth, ETH_DMASTS_TXFLG))
  {
    if (__DAL_ETH_DMA_GET_IT_SOURCE(heth, ETH_DMAINTEN_TXIEN))
    {
      /* Clear the Eth DMA Tx IT pending bits */
      __DAL_ETH_DMA_CLEAR_IT(heth, ETH_DMASTS_TXFLG | ETH_DMASTS_NINTS);

#if (USE_DAL_ETH_REGISTER_CALLBACKS == 1)
      /*Call registered Transmit complete callback*/
      heth->TxCpltCallback(heth);
#else
      /* Transfer complete callback */
      DAL_ETH_TxCpltCallback(heth);
#endif  /* USE_DAL_ETH_REGISTER_CALLBACKS */
    }
  }


  /* ETH DMA Error */
  if (__DAL_ETH_DMA_GET_IT(heth, ETH_DMASTS_AINTS))
  {
    if (__DAL_ETH_DMA_GET_IT_SOURCE(heth, ETH_DMAINTEN_AINTSEN))
    {
      heth->ErrorCode |= DAL_ETH_ERROR_DMA;

      /* if fatal bus error occurred */
      if (__DAL_ETH_DMA_GET_IT(heth, ETH_DMASTS_FBERRFLG))
      {
        /* Get DMA error code  */
        heth->DMAErrorCode = READ_BIT(heth->Instance->DMASTS, (ETH_DMASTS_FBERRFLG | ETH_DMASTS_TXSTS | ETH_DMASTS_RXSTS));

        /* Disable all interrupts */
        __DAL_ETH_DMA_DISABLE_IT(heth, ETH_DMAINTEN_NINTSEN | ETH_DMAINTEN_AINTSEN);

        /* Set DAL state to ERROR */
        heth->gState = DAL_ETH_STATE_ERROR;
      }
      else
      {
        /* Get DMA error status  */
        heth->DMAErrorCode = READ_BIT(heth->Instance->DMASTS, (ETH_DMASTS_ETXFLG | ETH_DMASTS_RXWTOFLG |
                                                              ETH_DMASTS_RXBU | ETH_DMASTS_AINTS));

        /* Clear the interrupt summary flag */
        __DAL_ETH_DMA_CLEAR_IT(heth, (ETH_DMASTS_ETXFLG | ETH_DMASTS_RXWTOFLG |
                                      ETH_DMASTS_RXBU | ETH_DMASTS_AINTS));
      }
#if (USE_DAL_ETH_REGISTER_CALLBACKS == 1)
      /* Call registered Error callback*/
      heth->ErrorCallback(heth);
#else
      /* Ethernet DMA Error callback */
      DAL_ETH_ErrorCallback(heth);
#endif  /* USE_DAL_ETH_REGISTER_CALLBACKS */

