betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_eth.c
  /* Prepare the MII register address value */
  tmpreg1 |= ((PHYAddr << 11U) & ETH_MACADDR_PA);                      /* Set the PHY device address */
  tmpreg1 |= (((uint32_t)PHYReg << 6U) & ETH_MACADDR_MR);              /* Set the PHY register address */
  tmpreg1 |= ETH_MACADDR_MW;                                           /* Set the write mode */
  tmpreg1 |= ETH_MACADDR_MB;                                           /* Set the MII Busy bit */

  /* Give the value to the MII data register */
  heth->Instance->MACDATA = (uint16_t)RegValue;

  /* Write the result value into the MII Address register */
  heth->Instance->MACADDR = tmpreg1;

  /* Get tick */
  tickstart = DAL_GetTick();

  /* Check for the Busy flag */
  while ((tmpreg1 & ETH_MACADDR_MB) == ETH_MACADDR_MB)
  {
    /* Check for the Timeout */
    if ((DAL_GetTick() - tickstart) > EXT_PHY_WRITE_TIMEOUT)
    {
      return DAL_ERROR;
    }

    tmpreg1 = heth->Instance->MACADDR;
  }

  return DAL_OK;
}

/**
  * @}
  */

/** @defgroup ETH_Exported_Functions_Group3 Peripheral Control functions
  *  @brief   ETH control functions
  *
@verbatim
  ==============================================================================
                      ##### Peripheral Control functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to control the ETH
    peripheral.

@endverbatim
  * @{
  */
/**
  * @brief  Get the configuration of the MAC and MTL subsystems.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  macconf: pointer to a ETH_MACConfigTypeDef structure that will hold
  *         the configuration of the MAC.
  * @retval DAL Status
  */
DAL_StatusTypeDef DAL_ETH_GetMACConfig(ETH_HandleTypeDef *heth, ETH_MACConfigTypeDef *macconf)
{
  if (macconf == NULL)
  {
    return DAL_ERROR;
  }

  /* Get MAC parameters */
  macconf->DeferralCheck = ((READ_BIT(heth->Instance->MACCFG, ETH_MACCFG_DC) >> 4) > 0U) ? ENABLE : DISABLE;
  macconf->BackOffLimit = READ_BIT(heth->Instance->MACCFG, ETH_MACCFG_BL);
  macconf->RetryTransmission = ((READ_BIT(heth->Instance->MACCFG, ETH_MACCFG_DISR) >> 9) == 0U) ? ENABLE : DISABLE;
  macconf->CarrierSenseDuringTransmit = ((READ_BIT(heth->Instance->MACCFG, ETH_MACCFG_DISCRS) >> 16) > 0U)
                                        ? ENABLE : DISABLE;
  macconf->ReceiveOwn = ((READ_BIT(heth->Instance->MACCFG, ETH_MACCFG_DISRXO) >> 13) == 0U) ? ENABLE : DISABLE;
  macconf->LoopbackMode = ((READ_BIT(heth->Instance->MACCFG, ETH_MACCFG_LBM) >> 12) > 0U) ? ENABLE : DISABLE;
  macconf->DuplexMode = READ_BIT(heth->Instance->MACCFG, ETH_MACCFG_DM);
  macconf->Speed = READ_BIT(heth->Instance->MACCFG, ETH_MACCFG_SSEL);
  macconf->Jabber = ((READ_BIT(heth->Instance->MACCFG, ETH_MACCFG_JDIS) >> 22) == 0U) ? ENABLE : DISABLE;
  macconf->Watchdog = ((READ_BIT(heth->Instance->MACCFG, ETH_MACCFG_WDTDIS) >> 23) == 0U) ? ENABLE : DISABLE;
  macconf->AutomaticPadCRCStrip = ((READ_BIT(heth->Instance->MACCFG, ETH_MACCFG_ACS) >> 7) > 0U) ? ENABLE : DISABLE;
  macconf->InterPacketGapVal = READ_BIT(heth->Instance->MACCFG, ETH_MACCFG_IFG);
  macconf->ChecksumOffload = ((READ_BIT(heth->Instance->MACCFG, ETH_MACCFG_IPC) >> 27) > 0U) ? ENABLE : DISABLE;


  macconf->TransmitFlowControl = ((READ_BIT(heth->Instance->MACFCTRL, ETH_MACFCTRL_TXFCTRLEN) >> 1) > 0U) ? ENABLE : DISABLE;
  macconf->ZeroQuantaPause = ((READ_BIT(heth->Instance->MACFCTRL, ETH_MACFCTRL_ZQPDIS) >> 7) == 0U) ? ENABLE : DISABLE;
  macconf->PauseLowThreshold = READ_BIT(heth->Instance->MACFCTRL, ETH_MACFCTRL_PTSEL);
  macconf->PauseTime = (READ_BIT(heth->Instance->MACFCTRL, ETH_MACFCTRL_PT) >> 16);
  macconf->ReceiveFlowControl = (READ_BIT(heth->Instance->MACFCTRL, ETH_MACFCTRL_RXFCTRLEN) > 0U) ? ENABLE : DISABLE;
  macconf->UnicastPausePacketDetect = ((READ_BIT(heth->Instance->MACFCTRL, ETH_MACFCTRL_UNPFDETE) >> 1) > 0U)
                                      ? ENABLE : DISABLE;

  return DAL_OK;
}

/**
  * @brief  Get the configuration of the DMA.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  dmaconf: pointer to a ETH_DMAConfigTypeDef structure that will hold
  *         the configuration of the ETH DMA.
  * @retval DAL Status
  */
DAL_StatusTypeDef DAL_ETH_GetDMAConfig(ETH_HandleTypeDef *heth, ETH_DMAConfigTypeDef *dmaconf)
{
  if (dmaconf == NULL)
  {
    return DAL_ERROR;
  }

  dmaconf->DMAArbitration = READ_BIT(heth->Instance->DMABMOD, ETH_DMABMOD_DSL) >> 2;
  dmaconf->AddressAlignedBeats = ((READ_BIT(heth->Instance->DMABMOD, ETH_DMABMOD_AAL) >> 12) > 0U) ? ENABLE : DISABLE;
  dmaconf->BurstMode = READ_BIT(heth->Instance->DMABMOD, ETH_DMABMOD_FB | ETH_DMABMOD_MB);
  dmaconf->RxDMABurstLength = READ_BIT(heth->Instance->DMABMOD, ETH_DMABMOD_RPBL);
  dmaconf->TxDMABurstLength = READ_BIT(heth->Instance->DMABMOD, ETH_DMABMOD_PBL);
  dmaconf->EnhancedDescriptorFormat = ((READ_BIT(heth->Instance->DMABMOD, ETH_DMABMOD_EDFEN) >> 7) > 0U) ? ENABLE : DISABLE;
  dmaconf->DescriptorSkipLength = READ_BIT(heth->Instance->DMABMOD, ETH_DMABMOD_DSL) >> 2;

  dmaconf->DropTCPIPChecksumErrorFrame = ((READ_BIT(heth->Instance->DMAOPMOD,
                                                    ETH_DMAOPMOD_DISDT) >> 26) > 0U) ? DISABLE : ENABLE;
  dmaconf->ReceiveStoreForward = ((READ_BIT(heth->Instance->DMAOPMOD, ETH_DMAOPMOD_RXSF) >> 25) > 0U) ? ENABLE : DISABLE;
  dmaconf->FlushRxPacket = ((READ_BIT(heth->Instance->DMAOPMOD, ETH_DMAOPMOD_FTXF) >> 20) > 0U) ? DISABLE : ENABLE;
  dmaconf->TransmitStoreForward = ((READ_BIT(heth->Instance->DMAOPMOD, ETH_DMAOPMOD_TXSF) >> 21) > 0U) ? ENABLE : DISABLE;
  dmaconf->TransmitThresholdControl = READ_BIT(heth->Instance->DMAOPMOD, ETH_DMAOPMOD_TXTHCTRL);
  dmaconf->ForwardErrorFrames = ((READ_BIT(heth->Instance->DMAOPMOD, ETH_DMAOPMOD_FERRF) >> 7) > 0U) ? ENABLE : DISABLE;
  dmaconf->ForwardUndersizedGoodFrames = ((READ_BIT(heth->Instance->DMAOPMOD,
                                                    ETH_DMAOPMOD_FUF) >> 6) > 0U) ? ENABLE : DISABLE;
  dmaconf->ReceiveThresholdControl = READ_BIT(heth->Instance->DMAOPMOD, ETH_DMAOPMOD_RXTHCTRL);
  dmaconf->SecondFrameOperate = ((READ_BIT(heth->Instance->DMAOPMOD, ETH_DMAOPMOD_OSECF) >> 2) > 0U) ? ENABLE : DISABLE;
  return DAL_OK;
}

/**
  * @brief  Set the MAC configuration.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  macconf: pointer to a ETH_MACConfigTypeDef structure that contains
  *         the configuration of the MAC.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ETH_SetMACConfig(ETH_HandleTypeDef *heth,  ETH_MACConfigTypeDef *macconf)
{
  if (macconf == NULL)
  {
    return DAL_ERROR;
  }

  if (heth->gState == DAL_ETH_STATE_READY)
  {
    ETH_SetMACConfig(heth, macconf);

    return DAL_OK;
  }
  else
  {
    return DAL_ERROR;
  }
}

/**
  * @brief  Set the ETH DMA configuration.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @param  dmaconf: pointer to a ETH_DMAConfigTypeDef structure that will hold
  *         the configuration of the ETH DMA.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_ETH_SetDMAConfig(ETH_HandleTypeDef *heth,  ETH_DMAConfigTypeDef *dmaconf)
{
  if (dmaconf == NULL)
  {
    return DAL_ERROR;
  }

  if (heth->gState == DAL_ETH_STATE_READY)
  {
    ETH_SetDMAConfig(heth, dmaconf);

    return DAL_OK;
  }
  else
  {
    return DAL_ERROR;
  }
}

/**
  * @brief  Configures the Clock range of ETH MDIO interface.
  * @param  heth: pointer to a ETH_HandleTypeDef structure that contains
  *         the configuration information for ETHERNET module
  * @retval None
  */
void DAL_ETH_SetMDIOClockRange(ETH_HandleTypeDef *heth)
{
  uint32_t hclk;
  uint32_t tmpreg;

